Revit 2026 API

# BasicLossFactor Class

---

This class encapsulates basic lighting loss factor calculation.

SystemObject Autodesk.Revit.DB.LightingLossFactor Autodesk.Revit.DB.LightingBasicLossFactor

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BasicLossFactor : LossFactor
```
```vb
Public Class BasicLossFactor
	Inherits LossFactor
```
```cpp
public ref class BasicLossFactor : public LossFactor
```
```fsharp
type BasicLossFactor =
    class
        inherit LossFactor
    end
```

The BasicLossFactor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BasicLossFactor | Creates a basic loss factor object with no loss. |
|  | BasicLossFactor(BasicLossFactor) | Creates a copy of the given basic loss factor object |
|  | BasicLossFactor(Double) | Creates a basic loss factor object with the given value. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from LossFactor) |
|  | LossFactor | The loss factor. |
|  | LossFactorValue | The calculated loss factor value (Inherited from LossFactor) |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LossFactor derived object. (Inherited from LossFactor) |
|  | Dispose | (Inherited from LossFactor) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace